# 4장 판다스 데이터프레임 Part1

## 4.2 데이터프레임 인덱스

In [4]:
from pandas import DataFrame

data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005670", "ACTS", 1185, 1.28]
]

columns = ["종목코드", "종목명", "현재가", "등락률"]
df = DataFrame(data, columns=columns)
df

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005670   ACTS  1185  1.28

In [10]:
from pandas import DataFrame

data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005670", "ACTS", 1185, 1.28]
]

columns = ["종목코드", "종목명", "현재가", "등락률"]
df = DataFrame(data=data, columns=columns)
df = df.set_index("종목코드")
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005670   ACTS  1185  1.28

In [11]:
from pandas import DataFrame

data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005670", "ACTS", 1185, 1.28]
]

columns = ["종목코드", "종목명", "현재가", "등락률"]
df = DataFrame(data=data, columns=columns)
df.set_index("종목코드", inplace=True)
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005670   ACTS  1185  1.28

In [12]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df.index.name = "종목코드"
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [13]:
df.index

Index(['037730', '036360', '005760'], dtype='object', name='종목코드')

In [14]:
type(df.index)

pandas.core.indexes.base.Index

## 4.3 데이터프레임 컬럼 인덱싱

In [16]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
print(df['현재가'])
df

037730    1510
036360    1790
005760    1185
Name: 현재가, dtype: int64

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [17]:
s = df['현재가']
print(s.index)
print(s.values)

Index(['037730', '036360', '005760'], dtype='object')
[1510 1790 1185]

In [18]:
리스트 = ["현재가", "등락률"]
df[리스트]

         현재가   등락률
037730  1510  7.36
036360  1790  1.65
005760  1185  1.28

In [19]:
df[['현재가']]

         현재가
037730  1510
036360  1790
005760  1185

## 4.4 데이터프레임 로우 인덱싱

In [20]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [21]:
df.loc["037730"]

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [22]:
print(df.iloc[0])
print(df.iloc[-1])

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object
종목명    ACTS
현재가    1185
등락률    1.28
Name: 005760, dtype: object

In [24]:
df.loc[ ["037730", "036360"] ]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [25]:
df.iloc[[0, 1]]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

## 4.5 특정 값 가져오기

In [26]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)

print(df.iloc[0])
print(df.loc['037730'])

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object
종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [27]:
# 행번호로 행 선택 후 시리즈 인덱싱 
print(df.iloc[0].iloc[1])            # 시리즈 행번호
print(df.iloc[0].loc["현재가"])        # 시리즈 인덱스 
print(df.iloc[0]["현재가"])            # 시리즈 인덱스

# 인덱스로 행 선택 후 시리즈 인덱싱 
print(df.loc["037730"].iloc[1])      # 시리즈 행번호
print(df.loc["037730"].loc["현재가"])  # 시리즈 인덱스 
print(df.loc["037730"]["현재가"])      # 시리즈 인덱스

1510
1510
1510
1510
1510
1510

In [28]:
s = df.iloc[0]
s

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [29]:
print(df.loc["037730", "현재가"])
print(df.iloc[0, 1])

1510
1510

In [31]:
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [32]:
print(df['현재가'].iloc[0])
print(df['현재가'].loc["037730"])
print(df['현재가']["037730"])

1510
1510
1510

## 4.6 특정 범위 가져오기

In [33]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)

print(df.loc[["037730", "036360"]])
print(df.iloc[[0, 1]])

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [34]:
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [35]:
df.loc[["037730", "036360"], ["종목명", "현재가"]]

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790

In [36]:
df.iloc[ [0, 1], [0, 1] ]

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790

## 4.7 데이터프레임 필터링

In [37]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [38]:
cond = df['현재가'] >= 1400
df.loc[cond]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [39]:
cond = df['현재가'] >= 1400
df.loc[cond]["현재가"]

037730    1510
036360    1790
Name: 현재가, dtype: int64

In [40]:
df.loc[cond, "현재가"]

037730    1510
036360    1790
Name: 현재가, dtype: int64

In [41]:
cond = (df['현재가'] >= 1400) & (df['현재가'] < 1700)
df.loc[cond]

       종목명   현재가   등락률
037730  3R  1510  7.36

## 4.8 컬럼 추가하기

In [42]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [45]:
from pandas import Series 

s = Series(data=[1600, 1600, 1600], index=df.index)
df['목표가'] = s
df

          종목명   현재가   등락률   목표가
037730     3R  1510  7.36  1600
036360  3SOFT  1790  1.65  1600
005760   ACTS  1185  1.28  1600

In [44]:
s

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [46]:
df["괴리율"] = (df["목표가"] - df["현재가"]) / df['현재가']
df

          종목명   현재가   등락률   목표가       괴리율
037730     3R  1510  7.36  1600  0.059603
036360  3SOFT  1790  1.65  1600 -0.106145
005760   ACTS  1185  1.28  1600  0.350211

In [89]:
import pandas as pd

# 간단한 과일 데이터 ---------------------------------------------
data = [
    ["사과", 1000, 50],
    ["바나나", 2000, 80],
    ["체리", 1500, 30]
]
index = ["F001", "F002", "F003"]
columns = ["상품명", "가격", "재고"]
df = pd.DataFrame(data=data, index=index, columns=columns)
df.index.name = "상품코드"
print("원본 DataFrame:\n", df)

# 1) 인덱싱 / 특정 값 가져오기 ---------------------------------------
# TODO 1-1: 상품코드 'F001'의 행을 loc으로 가져와 보세요.
row1 = df.loc['F001']
print(row1)

# TODO 1-2: 첫 번째 행(0번)을 iloc으로 가져와 보세요.
row2 = df.iloc[0]
print(row2)

# TODO 1-3: 'F001' 상품의 가격만 선택해 보세요.
v1 = df.loc['F001', '가격']
print(v1)
# 2) 범위 가져오기 ---------------------------------------------------
# TODO 2-1: 'F001','F002' 두 상품만, '상품명','가격'만 선택해 sub1에 저장
sub1 = df.loc[['F001','F002'], ['상품명','가격']]
print(sub1)

# 3) 필터링 ----------------------------------------------------------
# TODO 3-1: 가격이 1500원 이상인 상품만 선택해 보세요.
cond = df['가격'] >= 1500
f1 = df.loc[cond]
print(f1)

# TODO 3-2: 재고가 40개 이상이고 가격이 2000원 이하인 상품만 선택해 보세요.
cond = (df['재고'] >= 40) & (df['가격'] <= 2000)
f2 = df.loc[cond]
print(f2)

# 4) 컬럼/로우 추가하기 ----------------------------------------------
# TODO 4-1: 새 컬럼 "할인율"을 추가하고, 값은 [0.1, 0.2, 0.3]으로 넣어 보세요.
df['할인율'] = [0.1, 0.2, 0.3]

# TODO 4-2: 상품코드 'F004', ["포도", 3000, 20, 0.15] 를 새로운 행으로 추가해 보세요.
df.loc['F004'] = ["포도", 3000, 20, 0.15]
print(df)
# 5) 컬럼/로우 삭제 · 레이블 변경 ------------------------------------
# TODO 5-1: '재고' 컬럼을 삭제한 새로운 DataFrame을 new_df로 만들어 보세요.
new_df = df.drop('재고', axis=1)

# TODO 5-2: 컬럼 이름을 ['name','price','stock','discount'] 로 바꾸고,
#           인덱스 이름을 'code'로 바꿔 보세요.
df.columns = ['name','price','stock','discount']
df.index.name = 'code'

df

원본 DataFrame:
       상품명    가격  재고
상품코드
F001   사과  1000  50
F002  바나나  2000  80
F003   체리  1500  30
상품명      사과
가격     1000
재고       50
Name: F001, dtype: object
상품명      사과
가격     1000
재고       50
Name: F001, dtype: object
1000
      상품명    가격
상품코드
F001   사과  1000
F002  바나나  2000
      상품명    가격  재고
상품코드
F002  바나나  2000  80
F003   체리  1500  30
      상품명    가격  재고
상품코드
F001   사과  1000  50
F002  바나나  2000  80
      상품명    가격  재고   할인율
상품코드
F001   사과  1000  50  0.10
F002  바나나  2000  80  0.20
F003   체리  1500  30  0.30
F004   포도  3000  20  0.15

     name  price  stock  discount
code
F001   사과   1000     50      0.10
F002  바나나   2000     80      0.20
F003   체리   1500     30      0.30
F004   포도   3000     20      0.15

In [97]:
import pandas as pd

# ---------------------------------------------------------
# 초기 데이터
# ---------------------------------------------------------
data = [
    ["사과", 1000, 50],
    ["바나나", 2000, 80],
    ["체리", 1500, 30]
]
index = ["F001", "F002", "F003"]
columns = ["상품명", "가격", "재고"]
df = pd.DataFrame(data=data, index=index, columns=columns)
df.index.name = "상품코드"
print("원본 DataFrame:\n", df, "\n")

# ---------------------------------------------------------
# 1) 할인율 컬럼 추가 & 신상품 행 추가
# ---------------------------------------------------------
# TODO-1: 새 컬럼 '할인율' 추가 (예: [0.10, 0.20, 0.30])
df["할인율"] = [0.10, 0.20, 0.30]

# TODO-2: 신상품 'F004' 추가 (예: ["포도", 3000, 20, 0.15])
df.loc["F004"] = ["포도", 3000, 20, 0.15]

print("[1] 할인율 추가 & 신상품 추가:\n", df, "\n")

# ---------------------------------------------------------
# 2) 파생 컬럼 계산
# ---------------------------------------------------------
# TODO-3: '할인가격' = 가격 * (1 - 할인율)
df["할인가격"] = df['가격'] * (1 - df['할인율'])

# TODO-4: '매출가능액(할인전)' = 가격 * 재고
df["매출가능액(할인전)"] = df['가격'] * df['재고']

# TODO-5: '매출가능액(할인후)' = 할인가격 * 재고
df["매출가능액(할인후)"] = df['할인가격'] * df['재고']

print("[2] 파생 컬럼 추가:\n", df, "\n")

# ---------------------------------------------------------
# 3) 필터링 & 정렬
# ---------------------------------------------------------
# TODO-6: 재고가 40 이상이고, 할인가격이 1500 이하인 상품만 추출 -> sub
sub = df[(df['재고'] >= 40) & (df['할인가격'] <= 1500) ]
print("[3] 필터링 결과(sub):\n", sub, "\n")

# TODO-7: 매출가능액(할인후) 기준 내림차순 정렬 -> ranked
ranked = df.sort_values(by='매출가능액(할인후)', ascending=False)
display("[3] 매출가능액(할인후) 내림차순 정렬:\n", ranked[["상품명","할인율","할인가격","재고","매출가능액(할인후)"]], "\n")

# ---------------------------------------------------------
# 4) 최고 매출가능액 상품 찾기 (idxmax)
# ---------------------------------------------------------
# TODO-8: '매출가능액(할인후)'가 가장 큰 상품 코드와 값
best_code = ranked['매출가능액(할인후)'].idxmax()
best_value = ranked.loc[best_code, '매출가능액(할인후)']
print(f"[4] 최고 매출가능액 상품: {best_code} (금액 {int(best_value)}원)\n")

# ---------------------------------------------------------
# 5) 리네이밍 (컬럼/인덱스)
# ---------------------------------------------------------
# TODO-9: 컬럼명을 ['name','price','stock','discount','price_after','rev_before','rev_after'] 로 변경
#         인덱스명을 'code'로 변경
ranked.columns = ['name','price','stock','discount','price_after','rev_before','rev_after']
ranked.index.name = "code"
display("[5] 리네이밍 결과:\n", ranked, "\n")

원본 DataFrame:
       상품명    가격  재고
상품코드
F001   사과  1000  50
F002  바나나  2000  80
F003   체리  1500  30

[1] 할인율 추가 & 신상품 추가:
       상품명    가격  재고   할인율
상품코드
F001   사과  1000  50  0.10
F002  바나나  2000  80  0.20
F003   체리  1500  30  0.30
F004   포도  3000  20  0.15

[2] 파생 컬럼 추가:
       상품명    가격  재고   할인율    할인가격  매출가능액(할인전)  매출가능액(할인후)
상품코드
F001   사과  1000  50  0.10   900.0       50000     45000.0
F002  바나나  2000  80  0.20  1600.0      160000    128000.0
F003   체리  1500  30  0.30  1050.0       45000     31500.0
F004   포도  3000  20  0.15  2550.0       60000     51000.0

[3] 필터링 결과(sub):
      상품명    가격  재고  할인율   할인가격  매출가능액(할인전)  매출가능액(할인후)
상품코드
F001  사과  1000  50  0.1  900.0       50000     45000.0

'[3] 매출가능액(할인후) 내림차순 정렬:\n'

      상품명   할인율    할인가격  재고  매출가능액(할인후)
상품코드
F002  바나나  0.20  1600.0  80    128000.0
F004   포도  0.15  2550.0  20     51000.0
F001   사과  0.10   900.0  50     45000.0
F003   체리  0.30  1050.0  30     31500.0

'\n'

[4] 최고 매출가능액 상품: F002 (금액 128000원)

'[5] 리네이밍 결과:\n'

     name  price  stock  discount  price_after  rev_before  rev_after
code
F002  바나나   2000     80      0.20       1600.0      160000   128000.0
F004   포도   3000     20      0.15       2550.0       60000    51000.0
F001   사과   1000     50      0.10        900.0       50000    45000.0
F003   체리   1500     30      0.30       1050.0       45000    31500.0

'\n'

## 4.9 로우 추가하기

In [47]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [50]:
from pandas import Series 

s = Series(data=["LG전자", 60000, 3.84], index=df.columns)
df.loc["066570"] = s
df

          종목명    현재가   등락률
037730     3R   1510  7.36
036360  3SOFT   1790  1.65
005760   ACTS   1185  1.28
066570   LG전자  60000  3.84

In [63]:
df.loc["066570"] = ["LG전자", 60000, 3.84]

In [64]:
df

          종목명    현재가   등락률
037730     3R   1510  7.36
036360  3SOFT   1790  1.65
005760   ACTS   1185  1.28
066570   LG전자  60000  3.84

In [65]:
s = Series(data=["LG전자", 60000, 3.84], index=df.columns, name="066570")
df.append(s)

          종목명    현재가   등락률
037730     3R   1510  7.36
036360  3SOFT   1790  1.65
005760   ACTS   1185  1.28
066570   LG전자  60000  3.84
066570   LG전자  60000  3.84

## 4.10 컬럼/로우 삭제하기

In [68]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)

new_df = df.drop("현재가", axis=1)
print(df)
print(new_df)

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28
          종목명   등락률
037730     3R  7.36
036360  3SOFT  1.65
005760   ACTS  1.28

## 4.11 컬럼 레이블 변경

In [70]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)

In [71]:
print(df.columns)
print(df.index)

Index(['종목명', '현재가', '등락률'], dtype='object')
Index(['037730', '036360', '005760'], dtype='object')

In [72]:
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [73]:
df.columns = ['name', 'close', 'fluctuation']
df.index.name = 'code'
df

         name  close  fluctuation
code
037730     3R   1510         7.36
036360  3SOFT   1790         1.65
005760   ACTS   1185         1.28

In [76]:
from pandas import DataFrame

data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df.rename(columns={'종목명': 'code'}, inplace=True)
df

         code   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

## 4.12 데이터 타입 변경

In [79]:
from pandas import DataFrame

data = [
    ["1,000", "1,100", '1,510'],
    ["1,410", "1,420", '1,790'],
    ["850", "900", '1,185'],
]
columns = ["03/02", "03/03", "03/04"]
df = DataFrame(data=data, columns=columns)
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

In [80]:
def remove_comma(x):
    return int(x.replace(',', ''))

In [81]:
df['03/02'] = df['03/02'].map(remove_comma)

In [83]:
df['03/03'] = df['03/03'].map(remove_comma)

In [84]:
df

   03/02  03/03  03/04
0   1000   1100  1,510
1   1410   1420  1,790
2    850    900  1,185

In [85]:
from pandas import DataFrame

data = [
    ["1,000", "1,100", '1,510'],
    ["1,410", "1,420", '1,790'],
    ["850", "900", '1,185'],
]
columns = ["03/02", "03/03", "03/04"]
df = DataFrame(data=data, columns=columns)
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

In [86]:
df = df.applymap(remove_comma)
df

   03/02  03/03  03/04
0   1000   1100   1510
1   1410   1420   1790
2    850    900   1185

In [88]:
df.dtypes

03/02    int64
03/03    int64
03/04    int64
dtype: object

## 4.13 컬럼 문자열 다루기

In [92]:
from pandas import DataFrame

data = [
    {"cd":"A060310", "nm":"3S", "close":"2,920"},
    {"cd":"A095570", "nm":"AJ네트웍스", "close":"6,250"},
    {"cd":"A006840", "nm":"AK홀딩스", "close":"29,700"},
    {"cd":"A054620", "nm":"APS홀딩스", "close":"19,400"}
]
df = DataFrame(data=data)
df

        cd      nm   close
0  A060310      3S   2,920
1  A095570  AJ네트웍스   6,250
2  A006840   AK홀딩스  29,700
3  A054620  APS홀딩스  19,400

In [93]:
df.dtypes

cd       object
nm       object
close    object
dtype: object

In [94]:
df['cd'] = df['cd'].str[1:]

In [95]:
df

       cd      nm   close
0  060310      3S   2,920
1  095570  AJ네트웍스   6,250
2  006840   AK홀딩스  29,700
3  054620  APS홀딩스  19,400

In [97]:
df['close'] = df['close'].str.replace(',', '')

In [98]:
df

       cd      nm  close
0  060310      3S   2920
1  095570  AJ네트웍스   6250
2  006840   AK홀딩스  29700
3  054620  APS홀딩스  19400

In [119]:
import pandas as pd
import numpy as np

# --- 예시 데이터 ---
np.random.seed(0)
days = pd.date_range("2025-08-01", periods=7, freq="D")

# (A) 상품 마스터: 코드, 이름, 카테고리, 가격
master = pd.DataFrame({
    "code": ["F001","F002","F003","F004","F005"],
    "name": ["사과","바나나","체리","포도","망고"],
    "category": ["국산","수입","국산","수입","수입"],
    "price": [1000, 2000, 1500, 3000, 3500]
})

# (B) 일자별 판매(개수) 로그: day×code
sales_log = pd.DataFrame({
    "date": np.repeat(days, len(master)),
    "code": list(master["code"]) * len(days),
    "qty": np.random.randint(0, 21, size=len(days)*len(master))
})
display(master)

display(sales_log)
# 1) 판매 로그와 상품 마스터 결합(라벨 붙이기)
# TODO: left merge로 sales_log에 name/category/price 붙이기 → df
df = pd.merge(sales_log, master, on="code", how="inner")

# 2) 일별·상품별 매출액 계산: revenue = price * qty
# TODO: df["revenue"] 생성
df["revenue"] = df["price"] * df["qty"]
display(df)

# 3) 카테고리별 주간 합계 리포트 (qty, revenue)
# TODO: groupby("category")로 qty/revenue 합계 → cat_week
cat_week = df.groupby("category")[["qty", "revenue"]].sum()
display(cat_week)
# 4) 피벗테이블: 행=date, 열=category, 값=revenue (일자×카테고리 매출표)
# TODO: pivot_table로 피벗 생성 → pvt
pvt = pd.pivot_table(data=df, values="revenue", index="date", columns="category")
display(pvt)
# 5) 주간 매출 TOP 카테고리/상품 찾기
# TODO: cat_week에서 revenue 기준 내림차순 정렬 → top_cat
# TODO: 상품(name) 기준으로도 groupby 합계 후 revenue TOP 3 추출 → top_items
top_cat = cat_week.sort_values(by="revenue", ascending=False)
top_items = df.groupby("name")["revenue"].sum().sort_values(ascending=False)[0:3]
print(top_items)

print("=== 결합 DF 샘플 ===\n", df.head(), "\n")
print("=== 카테고리 주간 합계 ===\n", cat_week, "\n")
print("=== 일자×카테고리 피벗(매출) ===\n", pvt, "\n")
print("TOP 카테고리:\n", top_cat, "\n")
print("TOP 3 상품:\n", top_items, "\n")

   code name category  price
0  F001   사과       국산   1000
1  F002  바나나       수입   2000
2  F003   체리       국산   1500
3  F004   포도       수입   3000
4  F005   망고       수입   3500

         date  code  qty
0  2025-08-01  F001   12
1  2025-08-01  F002   15
2  2025-08-01  F003    0
3  2025-08-01  F004    3
4  2025-08-01  F005    3
5  2025-08-02  F001    7
6  2025-08-02  F002    9
7  2025-08-02  F003   19
8  2025-08-02  F004   18
9  2025-08-02  F005    4
10 2025-08-03  F001    6
11 2025-08-03  F002   12
12 2025-08-03  F003    1
13 2025-08-03  F004    6
14 2025-08-03  F005    7
15 2025-08-04  F001   14
16 2025-08-04  F002   17
17 2025-08-04  F003    5
18 2025-08-04  F004   13
19 2025-08-04  F005    8
20 2025-08-05  F001    9
21 2025-08-05  F002   20
22 2025-08-05  F003   19
23 2025-08-05  F004   16
24 2025-08-05  F005   19
25 2025-08-06  F001    5
26 2025-08-06  F002   15
27 2025-08-06  F003   15
28 2025-08-06  F004    0
29 2025-08-06  F005   18
30 2025-08-07  F001    3
31 2025-08-07  F002   17
32 2025-08-07  F003   19
33 2025-08-07  F004   19
34 2025-08-07  F005   19

         date  code  qty name category  price  revenue
0  2025-08-01  F001   12   사과       국산   1000    12000
1  2025-08-01  F002   15  바나나       수입   2000    30000
2  2025-08-01  F003    0   체리       국산   1500        0
3  2025-08-01  F004    3   포도       수입   3000     9000
4  2025-08-01  F005    3   망고       수입   3500    10500
5  2025-08-02  F001    7   사과       국산   1000     7000
6  2025-08-02  F002    9  바나나       수입   2000    18000
7  2025-08-02  F003   19   체리       국산   1500    28500
8  2025-08-02  F004   18   포도       수입   3000    54000
9  2025-08-02  F005    4   망고       수입   3500    14000
10 2025-08-03  F001    6   사과       국산   1000     6000
11 2025-08-03  F002   12  바나나       수입   2000    24000
12 2025-08-03  F003    1   체리       국산   1500     1500
13 2025-08-03  F004    6   포도       수입   3000    18000
14 2025-08-03  F005    7   망고       수입   3500    24500
15 2025-08-04  F001   14   사과       국산   1000    14000
16 2025-08-04  F002   17  바나나       수입   2000    34000
17 2025-08-04  F003    5   체리       국산   1500     7500
18 2025-08-04  F004   13   포도       수입   3000    39000
19 2025-08-04  F005    8   망고       수입   3500    28000
20 2025-08-05  F001    9   사과       국산   1000     9000
21 2025-08-05  F002   20  바나나       수입   2000    40000
22 2025-08-05  F003   19   체리       국산   1500    28500
23 2025-08-05  F004   16   포도       수입   3000    48000
24 2025-08-05  F005   19   망고       수입   3500    66500
25 2025-08-06  F001    5   사과       국산   1000     5000
26 2025-08-06  F002   15  바나나       수입   2000    30000
27 2025-08-06  F003   15   체리       국산   1500    22500
28 2025-08-06  F004    0   포도       수입   3000        0
29 2025-08-06  F005   18   망고       수입   3500    63000
30 2025-08-07  F001    3   사과       국산   1000     3000
31 2025-08-07  F002   17  바나나       수입   2000    34000
32 2025-08-07  F003   19   체리       국산   1500    28500
33 2025-08-07  F004   19   포도       수입   3000    57000
34 2025-08-07  F005   19   망고       수입   3500    66500

          qty  revenue
category
국산        134   173000
수입        258   708000

category         국산            수입
date
2025-08-01   6000.0  16500.000000
2025-08-02  17750.0  28666.666667
2025-08-03   3750.0  22166.666667
2025-08-04  10750.0  33666.666667
2025-08-05  18750.0  51500.000000
2025-08-06  13750.0  31000.000000
2025-08-07  15750.0  52500.000000

name
망고     273000
포도     225000
바나나    210000
Name: revenue, dtype: int64
=== 결합 DF 샘플 ===
         date  code  qty name category  price  revenue
0 2025-08-01  F001   12   사과       국산   1000    12000
1 2025-08-01  F002   15  바나나       수입   2000    30000
2 2025-08-01  F003    0   체리       국산   1500        0
3 2025-08-01  F004    3   포도       수입   3000     9000
4 2025-08-01  F005    3   망고       수입   3500    10500

=== 카테고리 주간 합계 ===
           qty  revenue
category
국산        134   173000
수입        258   708000

=== 일자×카테고리 피벗(매출) ===
 category         국산            수입
date
2025-08-01   6000.0  16500.000000
2025-08-02  17750.0  28666.666667
2025-08-03   3750.0  22166.666667
2025-08-04  10750.0  33666.666667
2025-08-05  18750.0  51500.000000
2025-08-06  13750.0  31000.000000
2025-08-07  15750.0  52500.000000

TOP 카테고리:
           qty  revenue
category
수입        258   708000
국산        134   173000

TOP 3 상품:
 name
망고     273000
포도     225000
바나나    210000
Name: revenue, dtype: int64

In [145]:
import pandas as pd
import numpy as np

np.random.seed(2)
days = pd.date_range("2025-08-01", periods=7, freq="D")

# 마스터
master = pd.DataFrame({
    "code": ["F001","F002","F003","F004"],
    "name": ["사과","바나나","체리","포도"],
    "price": [1000, 2000, 1500, 3000]
})

# 하루 판매수량(일자×상품)
qty = pd.DataFrame({
    "date": np.repeat(days, len(master)),
    "code": list(master["code"]) * len(days),
    "qty": np.random.randint(0, 31, size=len(days)*len(master))
})

# 결합
df = qty.merge(master, on="code", how="left")

# 시나리오 A: 전상품 10% 할인
# 시나리오 B: 일매출이 낮은 날(총수량<=60)만 20% 할인, 그 외는 0%
# 1) 일자별 총수량 계산해서 df에 붙이기

by_day_qty = df.groupby("date")["qty"].sum()
by_day_qty.rename("day_qty", inplace=True)

df = pd.merge(df, by_day_qty, on="date", how="inner")
df.columns = ["date", "code", "qty", "name", "price", "qty_total"]

# 2) A/B 할인가격 컬럼 만들기(price_A, price_B)
# TODO: price_A = price*0.9
# TODO: price_B = np.where(by_day_qty_total_condition, price*0.8, price)
df["price_A"] = df["price"] * 0.9
df["price_B"] = np.where(df["qty_total"] <= 60, df["price"] * 0.8, df["price"])

# 3) A/B 매출(revenue_A/B) 계산 후, 일자/전체 합 비교
df["revenue_A"] = df["qty"] * df["price_A"]
df["revenue_B"] = df["qty"] * df["price_B"]

daily = df.groupby("date")[["revenue_A", "revenue_B"]].sum()

totalA = df["revenue_A"].sum()
totalB = df["revenue_B"].sum()

# 4) A vs B 차이 큰 상품 Top-3 (전체 합 기준)
diff_by_item = df.groupby(['code', 'name'])[["revenue_A", "revenue_B"]].sum()

diff_by_item['diff'] = abs(diff_by_item["revenue_A"] - diff_by_item["revenue_B"])
top3 = diff_by_item.sort_values(by='diff', ascending=False).head(3)

print("=== 일자별 총수량 ===\n", by_day_qty, "\n")
print("=== 시나리오별 일자 매출 ===\n", daily, "\n")
print("총매출 A:", int(totalA), " / B:", int(totalB))
print("A-B 차이 Top3 상품:\n", top3, "\n")

=== 일자별 총수량 ===
 date
2025-08-01    44
2025-08-02    62
2025-08-03    34
2025-08-04    73
2025-08-05    73
2025-08-06    20
2025-08-07    47
Name: day_qty, dtype: int32

=== 시나리오별 일자 매출 ===
             revenue_A  revenue_B
date
2025-08-01    73350.0    65200.0
2025-08-02    93600.0   104000.0
2025-08-03    68400.0    60800.0
2025-08-04   138150.0   153500.0
2025-08-05   108900.0   121000.0
2025-08-06    30600.0    27200.0
2025-08-07    73350.0    65200.0

총매출 A: 586350  / B: 596900
A-B 차이 Top3 상품:
            revenue_A  revenue_B    diff
code name
F002 바나나    172800.0   177600.0  4800.0
F001 사과      77400.0    79400.0  2000.0
F003 체리     125550.0   127500.0  1950.0

In [ ]:
import pandas as pd

data = [
    {"cd":"A060310", "nm":"3S", "open":2920, "close":2800},
    {"cd":"A095570", "nm":"AJ네트웍스", "open":1920, "close":1900},
    {"cd":"A006840", "nm":"AK홀딩스", "open":2020, "close":2010},
    {"cd":"A054620", "nm":"APS홀딩스", "open":3120, "close":3200}
]
df = pd.DataFrame(data).set_index("cd")
print("원본\n", df, "\n")

# TODO-1: query로 'open > close' 인 행만 선택
q1 = ...

# TODO-2: query로 'nm'이 ['3S','AK홀딩스'] 중 하나인 행만
q2 = ...

# TODO-3: 변수 사용 (@name) — nm == @name
name = "AJ네트웍스"
q3 = ...

print(q1, "\n")
print(q2, "\n")
print(q3, "\n")